# Используйте официальный образ Python как базовый
FROM python:3.11

# Установите рабочую директорию в контейнере
WORKDIR /3lab

# Копируйте файлы requirements.txt в рабочую директорию
COPY requirements.txt /3lab/

# Установите зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируйте все остальные файлы вашего приложения в рабочую директорию
COPY . /3lab

# Сделайте порт доступным снаружи контейнера
EXPOSE 5000

# Задайте команду для запуска вашего приложения
CMD ["flask", "run", "--host=0.0.0.0"]
